app/controllers/recipes_controller.rb

  def index
    @recipes = Recipe.all
---
SELECT `recipes`.* FROM `recipes`

  def create



    @recipe = Recipe.new(recipe_params)
    # @recipe.materials = params[:material_id]
    # @material = @recipe.materials.build
    respond_to do |format|


      binding.pry

      if @recipe.save
---
INSERT INTO `recipes` (`title`, `image`, `user_id`, `created_at`, `updated_at`) VALUES ('aaa', 'mainasu.jpg', 1, '2021-01-28 00:47:31.912684', '2021-01-28 00:47:31.912684')

  def destroy
    @recipe.destroy
---
DELETE FROM `recipes` WHERE `recipes`.`id` = 4

    def set_recipe
      @recipe = Recipe.find(params[:id])
---
SELECT `recipes`.* FROM `recipes` WHERE `recipes`.`id` = 2 LIMIT 1